repitframework/Solvers/natural_convection/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    hot
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       79600;
    }
    cold
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       79800;
    }
    topAndBottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       80000;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          80000;
        startFace       80400;
    }
)

// ************************************************************************* //
